Drzet/esp_icg/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32p4"
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y

# ESP32-P4 rev1 hardware support
CONFIG_ESP32P4_SELECTS_REV_LESS_V3=y

# Camera frame buffers need fast PSRAM
CONFIG_SPIRAM=y
CONFIG_IDF_EXPERIMENTAL_FEATURES=y
CONFIG_SPIRAM_SPEED_200M=y
CONFIG_SPIRAM_USE_CAPS_ALLOC=y
CONFIG_CACHE_L2_CACHE_256KB=y
CONFIG_CACHE_L2_CACHE_LINE_128B=y

# IMX708: CSI + ISP only. Keep IPA/pipeline controller and autofocus off on this fixed-focus module.
CONFIG_ESP_VIDEO_ENABLE_MIPI_CSI_VIDEO_DEVICE=y
CONFIG_ESP_VIDEO_ENABLE_ISP_VIDEO_DEVICE=y
CONFIG_ESP_VIDEO_ENABLE_ISP_PIPELINE_CONTROLLER=n
CONFIG_CAMERA_IMX708=y
CONFIG_CAMERA_IMX708_AUTO_DETECT_MIPI_INTERFACE_SENSOR=y
CONFIG_CAMERA_IMX708_MIPI_IF_FORMAT_INDEX_DEFAULT=0
CONFIG_CAMERA_IMX219=n
CONFIG_CAM_MOTOR_DW9807=n
CONFIG_ESP_IPA_AF_ALGORITHM=n

CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192
